const questions = [
  "1 أكون عادة غير واثقا من نفسي ومتوترة عند لقائي بآخرین",
  "2 ألاحظ أني أفكر في أشياء، ليس لها علاقة بالموقف الذي أكون فيه",
  "3 أشعر دائما بردود أفعال جسدي، كالحكة والألم والتعرق والغثيان مثلا عندما أكون مع الآخرين",
  "4 أشعر وكأني مشلول عندما أفكر في لقاء على القيام به مع أشخاص آخرين",
  "5 أكون متوترة جدا قبل حدوث موقف اجتماعي ما",
  "6 أفكر في أشياء غير مهمة عندما أكون مع أشخاص آخرین",
  "7 يخفق قلبي عندما أكون بين الآخرين في موقف اجتماعي ما",
  "8 تشرد أفكاري دائما أثناء مخالطتي للآخرين",
  "9 أكون متوترة أثناء وجودي بين الآخرين",
  "10 ألاحظ أنني أشعر بالخوف قبل حدوث موقف اجتماعي",
  "11 يصبح العمل صعبا علي عندما أشعر أن أحدهم ينظر إلي أثناء قيامي به",
  "12 عندما أكون في حفلة ما أو بين مجموعة أشخاص فإني لا أصدق كيف تنتهي هذه الحفلة",
  "13 أكون عاجزة عن النقاش إذا دار حديث ما ضمن مجموعة من الأفراد",
  "14 كثرة الناس حولي تربكني",
  "15 أشعر بالصداع في أثناء وجودي في المواقف الاجتماعية المهمة",
  "16 قبل أن أدخل في موقف اجتماعي أكون مهموما من احتمال فشلي في هذا الموقف",
  "17 أصاب بالصداع قبل حدوث ملاقاة اجتماعية ما",
  "18 غالبا ما أكون مترددة عندما أريد أن أسأل شخصا ما عن أمر",
  "19 أحيانا أشعر بالدوار عندما أتجاذب الحديث مع الآخرين",
  "20 غالبا ما تشرد أفكاري في المواقف الاجتماعية",
  "21 أشعر بالخجل عندما أتحدث مع شخص مهم",
  "22 أنزعج عندما ينظر إلي الناس في الشارع أو الأماكن العامة",
  "23 عندما أكون بين الآخرين فإني غالبا ما أظل في الخلفية",
  "24 أحتاج لوقت حتى أستطيع التغلب على خجلي في المواقف غير المألوفة",
  "25 يصعب علي التعبير عن رأيي في نقاش مع أشخاص لا أعرفهم",
  "26 يكون حلقي جافا عندما أكون بين الآخرين",
  "27 من الصعب علي أن أتحدث مع شخص لا أعرفه",
  "28 أعاني من قلق مرعب عندما أكون بين الناس",
  "29 أشعر بالضيق الشديد والارتباك عندما يكون علي الحديث أمام مجموعة",
];

let current = 0;
let answers = [];

const container = document.getElementById("questionContainer");
const progress = document.getElementById("progressBar");

function render() {
  container.innerHTML = `
<div class="question">
<h3>${questions[current]}</h3>

<label class="option" onclick="selectAnswer(2)">دائماً</label>
<label class="option" onclick="selectAnswer(1)">أحياناً</label>
<label class="option" onclick="selectAnswer(0)">أبداً</label>

</div>
`;

  progress.style.width = ((current + 1) / questions.length) * 100 + "%";
}

function selectAnswer(val) {
  answers.push(val);
  current++;

  if (current < questions.length) {
    render();
  } else {
    showResult();
  }
}

function showResult() {
  let total = answers.reduce((a, b) => a + b, 0);

 
  let level = "";

  if (total <= 19) {
    level = "قلق اجتماعي منخفض";
  } else if (total <= 38) {
    level = "قلق اجتماعي متوسط";
  } else {
    level = "قلق اجتماعي مرتفع";
  }

  container.innerHTML = `
<div class="resultBoxNew">

<h2>النتيجة النهائية</h2>
<div class="miniCard">
<p class="title">مستوى القلق</p>
<p class="value">${level}</p>
</div>

<p class="desc">
${
  level === "قلق اجتماعي منخفض"
    ? "لا يوجد لديك قلق اجتماعي ملحوظ."
    : level === "قلق اجتماعي متوسط"
      ? "لديك بعض القلق في المواقف الاجتماعية."
      : "مستوى القلق لديك مرتفع ويفضل العمل على تحسينه أو استشارة مختص."
}
</p>
<a href="../index.html" class="btnMain">احجز جلسة</a>
</div>

`;
}

render();
